# 1. Pandas Series

## 1.1. Oluşturma ve Özellikleri

In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.Series([1,2,3,4])  # indexler ile tek bir veri anlamında seriles oluşturmak.

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
seri = pd.Series([1,2,3,4])

In [5]:
type(seri)

pandas.core.series.Series

In [6]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [7]:
seri.dtype

dtype('int64')

In [8]:
seri.empty  # boş bir değer olup olmadığını sorgular, cevabı boolean olarak belirtir.

False

In [9]:
seri.ndim

1

In [10]:
seri.size

4

In [11]:
seri.values  # sadece değerlerini gösterir.

array([1, 2, 3, 4], dtype=int64)

In [12]:
seri.head(2)  # serinin ilk 2 değerine ve indexine erişilir.

0    1
1    2
dtype: int64

In [13]:
seri[0:3]  # slice işlemi ile de işlem gerçekleşebilir.

0    1
1    2
2    3
dtype: int64

In [14]:
seri.tail(2)  # serinin sondan iki değerini ve indexine erişilir.

2    3
3    4
dtype: int64

In [15]:
a = np.array([1,2,3,566,88])
a

array([  1,   2,   3, 566,  88])

In [16]:
type(a)

numpy.ndarray

In [19]:
seri1 = pd.Series(a)  # a arrayini 'seri1' isimli pandas serisine dönüştürür.

In [20]:
seri1

0      1
1      2
2      3
3    566
4     88
dtype: int32

In [22]:
seri1.index   # 0 dan 5 e kadar gidiyor, adımları ise 1 er 1 er.

RangeIndex(start=0, stop=5, step=1)

In [23]:
seri1[0]

1

In [25]:
pd.Series([1,5,0.9,34], index = [1,3,5,7])   # elimizde oluşturduğumuz serinin indekslerini de kendimiz belirliyebiliriz.

1     1.0
3     5.0
5     0.9
7    34.0
dtype: float64

In [26]:
pd.Series([1,5,0.9,34], index = ['a', 'b', 'c', 'd'])   # indekslerimiz görüldüğü üzere 'string' olarak da belirtilebilir.

a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [27]:
seri2 = pd.Series([1,5,0.9,34], index = ['a', 'b', 'c', 'd'])

In [29]:
seri2['a']

1.0

In [30]:
sozluk = {"reg" : 10, "loj" : 11, "cart" : 12}
sozluk

{'reg': 10, 'loj': 11, 'cart': 12}

In [33]:
pd.Series(sozluk)   # dictinary(sözlük) leri de pandas serilerine dönüştürebiliriz. 'Key' = indeks yerine geçer

reg     10
loj     11
cart    12
dtype: int64

In [34]:
seri3 = pd.Series(sozluk)

In [35]:
seri3["reg"]

10

In [38]:
seri3["reg":"cart"]  # indeks değerinin adına kadar(adı dahil) olacak şekilde sıralanır.

reg     10
loj     11
cart    12
dtype: int64

In [41]:
seri3["loj":"cart"]  # 'loj' indeksinden 'cart' indeksine kadar. Fakat 'cart' string olduğundan dahildir.

loj     11
cart    12
dtype: int64

In [40]:
seri1[0:3]  # burada görüldüğü gibi 0. indeksten 3. indekse kadar fakat 3 dahil değil.

0    1
1    2
2    3
dtype: int32

In [42]:
seri3

reg     10
loj     11
cart    12
dtype: int64

In [45]:
pd.concat([seri3, seri3])   # serileri 'concat' fonksiyonu ile alt alta birleştirir.

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

In [46]:
seri3.append(seri3)  # serileri append ile de birleştirebiliriz.

reg     10
loj     11
cart    12
reg     10
loj     11
cart    12
dtype: int64

-------------------

## 1.2. Eleman İşlemleri

In [49]:
import numpy as np
import pandas as pd

a = np.array([1, 2, 3, 33, 55, 66])
seri = pd.Series(a)
seri

0     1
1     2
2     3
3    33
4    55
5    66
dtype: int32

In [50]:
seri[0]

1

In [51]:
seri[0:3]

0    1
1    2
2    3
dtype: int32

In [52]:
seri2 = pd.Series([121, 200, 150, 99], index = ["reg", "loj", "cart", "rf"])
seri2

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [53]:
seri2.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [55]:
seri2.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

In [56]:
list(seri2.items())

[('reg', 121), ('loj', 200), ('cart', 150), ('rf', 99)]

In [57]:
seri2.values

array([121, 200, 150,  99], dtype=int64)

In [58]:
seri2

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [60]:
"knn" in seri2  # 'knn' stringi seri2 nin içerisinde bulunup bulunmadığı ile ilgili boolean cevabı

False

In [61]:
seri2["reg"]

121

In [63]:
seri2[['rf','reg']]  # fancy index ile de pandas serilerini kullanabiliriz.

rf      99
reg    121
dtype: int64

In [64]:
seri2["rf"] = 125

In [65]:
seri2

reg     121
loj     200
cart    150
rf      125
dtype: int64

In [67]:
seri2['loj':'rf']

loj     200
cart    150
rf      125
dtype: int64

In [68]:
seri2[0:2]

reg    121
loj    200
dtype: int64

In [69]:
seri3 = pd.Series([121, 200, 150, 99], index = ["reg", "loj", "cart", "rf"])
seri3

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [70]:
seri3[(seri3 > 125) & (seri3 < 200)]

cart    150
dtype: int64

In [71]:
data = pd.Series(['a','b','c'], index = [1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [74]:
data[0]

KeyError: 0

In [75]:
data[1]

'a'

In [76]:
data[1:3]   # 1. indeksi almadı.(alması gerekmesine rağmen)

3    b
5    c
dtype: object

In [78]:
data[0:3]  # burada ise bütün indeksleri değerleri ile birlikte gösterdi.

1    a
3    b
5    c
dtype: object

In [79]:
# loc label based indexing, tanımlandığı şekli ile index yakalamak.

In [80]:
data

1    a
3    b
5    c
dtype: object

In [81]:
data.loc[1]

'a'

In [83]:
data.loc[2]

KeyError: 2

In [84]:
data.loc[3]  # loc ifadesi, tanımlamış olduğu indexlere göre işlem yapar.

'b'

In [86]:
data.loc[0:1]  # ifademiz şimdi olması gerektiği gibi gerçekleşti.

1    a
dtype: object

In [87]:
data.loc[0:2]

1    a
dtype: object

In [88]:
data.loc[0:4]

1    a
3    b
dtype: object

In [90]:
data.loc[0:5]   # fakat 5 dahil edildi, yani sınırda yazdığımız son değeri de dahil ediyor.

1    a
3    b
5    c
dtype: object

In [91]:
# iloc positional indexing, indexi sıfırlayarak yakalamak

In [92]:
data.iloc[0]

'a'

In [95]:
data.iloc[0:3]  # şimdi tam istediğimiz gibi oldu.

1    a
3    b
5    c
dtype: object

-------------------------------

# 2. Dataframes

## 2.1. Oluşturma ve Özellikleri

In [96]:
l = [1,4,577,343]

In [109]:
pd.DataFrame(l, columns = ["degisken_ismi"])   # listeler üzerinden dataframe yapılabilir.

   degisken_ismi
0              1
1              4
2            577
3            343

In [98]:
df = pd.DataFrame(l, columns = ["degisken_ismi"])

In [99]:
type(df)

pandas.core.frame.DataFrame

In [100]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['degisken_ismi'], dtype='object')]

In [101]:
df.shape

(4, 1)

In [102]:
df.ndim

2

In [103]:
df.size

4

In [104]:
df.values

array([[  1],
       [  4],
       [577],
       [343]], dtype=int64)

In [105]:
df.head(2)

   degisken_ismi
0              1
1              4

In [106]:
df.tail(2)

   degisken_ismi
2            577
3            343

In [107]:
a = np.array([1,2,3,4,56])

In [108]:
pd.DataFrame(a, columns = ["degisken_ismi"])  # numpy arrayi üzerinden de dataframe yapılabiliyor.

   degisken_ismi
0              1
1              2
2              3
3              4
4             56

In [110]:
m = np.arange(1,10).reshape((3,3))

In [111]:
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"])   # her bir kolon için farklı bir isimlendirme yapılabilir.

In [112]:
df1

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [113]:
df1.columns = ('deg1', 'deg2', 'deg3')   # kolonların isimleri bu şekilde değiştirilebilir.

In [114]:
df1

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [115]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"], index = ["row1", "row2", "row3"])

      var1  var2  var3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [116]:
df1 = pd.DataFrame(m, columns = ["var1", "var2", "var3"], index = ["row1", "row2", "row3"])

In [117]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [125]:
df1

      var1  var2  var3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [127]:
pd.DataFrame(pd.Series([1,2,3,4]), columns = ["col1"])

   col1
0     1
1     2
2     3
3     4

In [128]:
bir = pd.Series([1,2,3,4])
iki = pd.Series([5,6,7,8])

In [131]:
pd.DataFrame({"col1" : bir, "col2" : iki})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [132]:
sozluk = {"reg" : {"RMSE" : 10, "MSE" : 11, "SSE" : 90},
          "loj" : {"RMSE" : 89, "MSE" : 12, "SSE" : 45},
          "cart": {"RMSE" : 45, "MSE" : 22, "SSE" : 11}}

In [133]:
pd.DataFrame(sozluk)

      reg  loj  cart
MSE    11   12    22
RMSE   10   89    45
SSE    90   45    11

---------------------

## 2.2. Eleman İşlemleri

In [147]:
import numpy as np
import pandas as pd

s1 = np.random.randint(0,10, size = 5)
s2 = np.random.randint(0,10, size = 5)
s3 = np.random.randint(0,10, size = 5)

In [148]:
df = pd.DataFrame({"col1" : s1, "col2" : s2, "col3" : s3})   # sözlüklerden dataframe yaratabiliriz.
df

   col1  col2  col3
0     2     5     0
1     0     0     1
2     6     5     6
3     4     0     7
4     9     2     1

In [136]:
df[0:1]

   col1  col2  col3
0     5     5     5

In [149]:
df.index = ["row1", "row2", "row3", "row4", "row5"]  # indexleri bu şekilde isimlendirebiliriz.

In [138]:
df

      col1  col2  col3
row1     5     5     5
row2     3     4     9
row3     2     3     8
row4     9     5     3
row5     1     8     5

In [139]:
df['row3':"row5"]

      col1  col2  col3
row3     2     3     8
row4     9     5     3
row5     1     8     5

In [140]:
df.drop("row1", axis = 0)

      col1  col2  col3
row2     3     4     9
row3     2     3     8
row4     9     5     3
row5     1     8     5

In [141]:
df

      col1  col2  col3
row1     5     5     5
row2     3     4     9
row3     2     3     8
row4     9     5     3
row5     1     8     5

In [150]:
df.drop("row5", axis = 0, inplace =True)

In [151]:
df

      col1  col2  col3
row1     2     5     0
row2     0     0     1
row3     6     5     6
row4     4     0     7

In [152]:
l = ["row2", "row3"]

In [163]:
df.drop(l, axis = 0, inplace = True)  # inplace yazmazsan df eski halindeki gibi kalır, outputta 'l' yi atmasına rağmen.

KeyError: "['col1' 'col2' 'col4'] not found in axis"

In [154]:
df

      col1  col2  col3
row1     2     5     0
row4     4     0     7

In [155]:
"var" in df

False

In [156]:
"var1" in df

False

In [157]:
"col1" in df

True

In [160]:
l = ["col1", "col2", "col4"]

In [161]:
for i in l:
    print(i in df)

True
True
False

In [162]:
df["col1"] is df["col2"]    # iki değişkenin aynı olup olmadığını sorgular.

False

In [164]:
df["col2"]  # sözlük tipi seçim

row1    5
row4    0
Name: col2, dtype: int32

In [167]:
df.col2   # attributes tipi seçim

row1    5
row4    0
Name: col2, dtype: int32

In [168]:
df[["col1", "col2"]]

      col1  col2
row1     2     5
row4     4     0

In [169]:
l = ["col1", "col2"]

In [170]:
df[l]

      col1  col2
row1     2     5
row4     4     0

In [171]:
df

      col1  col2  col3
row1     2     5     0
row4     4     0     7

In [172]:
df["col4"] = df["col1"] / df["col2"]

In [173]:
df

      col1  col2  col3  col4
row1     2     5     0   0.4
row4     4     0     7   inf

In [174]:
df.drop("col4", axis = 1, inplace = True)

In [175]:
df

      col1  col2  col3
row1     2     5     0
row4     4     0     7

In [176]:
df

      col1  col2  col3
row1     2     5     0
row4     4     0     7

In [178]:
s1 = np.random.randint(0,10, size = 5)
s2 = np.random.randint(0,10, size = 5)
s3 = np.random.randint(0,10, size = 5)
df = pd.DataFrame({"col1" : s1, "col2" : s2, "col3" : s3})
df

   col1  col2  col3
0     8     6     6
1     3     4     9
2     5     7     3
3     3     9     6
4     9     3     9

In [179]:
df.index = ["row1", "row2", "row3", "row4", "row5"]

In [180]:
df

      col1  col2  col3
row1     8     6     6
row2     3     4     9
row3     5     7     3
row4     3     9     6
row5     9     3     9

In [182]:
df.iloc[0:3]

      col1  col2  col3
row1     8     6     6
row2     3     4     9
row3     5     7     3

In [183]:
df.iloc[0,0]  # satır ve kolonun ilk kesişen elemanı

8

In [184]:
df.iloc[:3, :2]  # 0. satırdan 3. satıra ve 0. kolondan 2. kolona kadar olan bölge

      col1  col2
row1     8     6
row2     3     4
row3     5     7

In [186]:
df.iloc[2:6, 1:3]

      col2  col3
row3     7     3
row4     9     6
row5     3     9

In [191]:
df

      col1  col2  col3
row1     8     6     6
row2     3     4     9
row3     5     7     3
row4     3     9     6
row5     9     3     9

In [196]:
df.loc["row1":"row3", "col3"]

row1    6
row2    9
row3    3
Name: col3, dtype: int32

In [197]:
df.index = ["a", "b", "c", "d", "e"]

In [198]:
df

   col1  col2  col3
a     8     6     6
b     3     4     9
c     5     7     3
d     3     9     6
e     9     3     9

In [200]:
df[df.col1 > 5]

   col1  col2  col3
a     8     6     6
e     9     3     9

In [201]:
df[df.col2 > 5]["col2"]

a    6
c    7
d    9
Name: col2, dtype: int32

In [202]:
df[(df.col1 > 5) & (df.col3 < 7)]

   col1  col2  col3
a     8     6     6

In [203]:
df.loc[df.col1 > 5, ["col1", "col2"]]

   col1  col2
a     8     6
e     9     3

------------------

## 2.3. Birleştirme İşlemleri(merge - join)

In [206]:
import numpy as np
import pandas as pd

s1 = np.random.randint(0,10, size = 5)
s2 = np.random.randint(0,10, size = 5)
s3 = np.random.randint(0,10, size = 5)

df1 = pd.DataFrame({"var1":s1, "var2":s2, "var3":s3})
df1

   var1  var2  var3
0     1     6     2
1     9     0     2
2     4     4     9
3     5     5     8
4     6     9     9

In [207]:
df2 = df1 + 99
df2

   var1  var2  var3
0   100   105   101
1   108    99   101
2   103   103   108
3   104   104   107
4   105   108   108

In [208]:
pd.concat([df1,df2])  # dataframleri satır bazında birleştirir.

   var1  var2  var3
0     1     6     2
1     9     0     2
2     4     4     9
3     5     5     8
4     6     9     9
0   100   105   101
1   108    99   101
2   103   103   108
3   104   104   107
4   105   108   108

In [209]:
pd.concat([df1,df2], axis = 1)  # dataframeleri kolon bazında birleştirir.

   var1  var2  var3  var1  var2  var3
0     1     6     2   100   105   101
1     9     0     2   108    99   101
2     4     4     9   103   103   108
3     5     5     8   104   104   107
4     6     9     9   105   108   108

In [210]:
pd.concat([df1,df2], ignore_index = True)   # dataframelerde concatlama yapıldığında, indexleri baştan hazırlar.

   var1  var2  var3
0     1     6     2
1     9     0     2
2     4     4     9
3     5     5     8
4     6     9     9
5   100   105   101
6   108    99   101
7   103   103   108
8   104   104   107
9   105   108   108

In [211]:
df2.columns = ["var1", "var2", "deg3"]

In [212]:
df2

   var1  var2  deg3
0   100   105   101
1   108    99   101
2   103   103   108
3   104   104   107
4   105   108   108

In [216]:
pd.concat([df1,df2])   # dataframelerde birleştirme(concat) işlemini birleştirme sonrasında kolonlar farklıysa bazı değerleri 'NaN' olarak döner.

C:\Users\Sefa3\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     1     6   2.0
1    NaN     9     0   2.0
2    NaN     4     4   9.0
3    NaN     5     5   8.0
4    NaN     6     9   9.0
0  101.0   100   105   NaN
1  101.0   108    99   NaN
2  108.0   103   103   NaN
3  107.0   104   104   NaN
4  108.0   105   108   NaN

In [217]:
pd.concat([df1,df2], join = "inner")  # birleştirme işleminde kolonları aynı isme sahip olanları bu şekilde görebiliriz.

   var1  var2
0     1     6
1     9     0
2     4     4
3     5     5
4     6     9
0   100   105
1   108    99
2   103   103
3   104   104
4   105   108

In [218]:
pd.concat([df1,df2], join_axes = [df1.columns])  # df1 kolonlarını baz alarak df2 nin değişkenlerini belirtir.

   var1  var2  var3
0     1     6   2.0
1     9     0   2.0
2     4     4   9.0
3     5     5   8.0
4     6     9   9.0
0   100   105   NaN
1   108    99   NaN
2   103   103   NaN
3   104   104   NaN
4   105   108   NaN

In [219]:
# merge join

In [220]:
df1 = pd.DataFrame({"Calisanlar" : ["Ali", "Veli", "Ayse", "Fatma"],
                    "Grup" : ["Muhasebe", "Muhendislik", "Muhendislik", "IK"]})

df2 = pd.DataFrame({"Calisanlar" : ["Ayse", "Ali", "Veli", "Fatma"],
                    "ilk_giris" : [2010, 2009, 2014, 2019]})

df4 = pd.DataFrame({"Grup" : ["Muhasebe", "Muhendislik", "IK"],
                    "Mudur" : ["Caner", "Mustafa", "Berkcan"]})

df5 = pd.DataFrame({"Grup" : ["Muhasebe", "Muhasebe", "Muhendislik", "Muhendislik", "IK", "IK"],
                    "Yetenekler" : ["Matematik", "Excel", "Kodlama", "Linux", "Excel", "Yonetim"]})

In [221]:
df1

  Calisanlar         Grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [222]:
df2

  Calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [223]:
df4

          Grup    Mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [224]:
df5

          Grup Yetenekler
0     Muhasebe  Matematik
1     Muhasebe      Excel
2  Muhendislik    Kodlama
3  Muhendislik      Linux
4           IK      Excel
5           IK    Yonetim

In [226]:
pd.merge(df1, df2)  # merge fonksiyonu df1 ve df2 yi değişkenlere göre düzenli bir şekilde birleştirir.

  Calisanlar         Grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [227]:
pd.merge(df1, df2, on = "Calisanlar")

  Calisanlar         Grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [229]:
df3 = pd.merge(df1, df2)

In [230]:
df3

  Calisanlar         Grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           IK       2019

In [231]:
df4

          Grup    Mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [232]:
pd.merge(df3, df4)

  Calisanlar         Grup  ilk_giris    Mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           IK       2019  Berkcan

In [233]:
df5

          Grup Yetenekler
0     Muhasebe  Matematik
1     Muhasebe      Excel
2  Muhendislik    Kodlama
3  Muhendislik      Linux
4           IK      Excel
5           IK    Yonetim

In [234]:
df1

  Calisanlar         Grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [235]:
pd.merge(df1, df5)

  Calisanlar         Grup Yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe      Excel
2       Veli  Muhendislik    Kodlama
3       Veli  Muhendislik      Linux
4       Ayse  Muhendislik    Kodlama
5       Ayse  Muhendislik      Linux
6      Fatma           IK      Excel
7      Fatma           IK    Yonetim

In [236]:
df3 = pd.DataFrame({"name" : ["Ali", "Veli", "Ayse", "Fatma"],
                    "maas" : [70000, 80000, 120000, 90000]})

In [237]:
df3

    name    maas
0    Ali   70000
1   Veli   80000
2   Ayse  120000
3  Fatma   90000

In [238]:
df1

  Calisanlar         Grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [239]:
pd.merge(df1, df3)

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [241]:
pd.merge(df1, df3, left_on = "Calisanlar", right_on = "name")   # calisanlar sol tarafında, name sağ tarafında olucak şekilde birleştirdi.

  Calisanlar         Grup   name    maas
0        Ali     Muhasebe    Ali   70000
1       Veli  Muhendislik   Veli   80000
2       Ayse  Muhendislik   Ayse  120000
3      Fatma           IK  Fatma   90000

In [242]:
pd.merge(df1, df3, left_on = "Calisanlar", right_on = "name").drop("name", axis = 1)   # name i iptal edebilmek için drop kullandık. Axis i 1 e eşitlemeyi unutma.

  Calisanlar         Grup    maas
0        Ali     Muhasebe   70000
1       Veli  Muhendislik   80000
2       Ayse  Muhendislik  120000
3      Fatma           IK   90000

In [245]:
df1.set_index("Calisanlar")   # df1 in satırlarına isim atamak için bu fonksiyonu kullandık.

                   Grup
Calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                IK

In [244]:
df1

  Calisanlar         Grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [246]:
df1a = df1.set_index("Calisanlar")   # df1a olarak kaydettik. Bir değişkeni index ismi olarak atadık.

In [249]:
df1a.shape   # buda ispatı

(4, 1)

In [248]:
df1a

                   Grup
Calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                IK

In [250]:
df2

  Calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [251]:
df2a = df2.set_index("Calisanlar")

In [252]:
df2a

            ilk_giris
Calisanlar
Ayse             2010
Ali              2009
Veli             2014
Fatma            2019

In [254]:
df1a

                   Grup
Calisanlar
Ali            Muhasebe
Veli        Muhendislik
Ayse        Muhendislik
Fatma                IK

In [255]:
pd.merge(df1a, df2a, left_index = True, right_index = True)

                   Grup  ilk_giris
Calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                IK       2019

In [256]:
df1a.join(df2a)

                   Grup  ilk_giris
Calisanlar
Ali            Muhasebe       2009
Veli        Muhendislik       2014
Ayse        Muhendislik       2010
Fatma                IK       2019

In [257]:
dfa = pd.DataFrame({"calisanlar" : ["Ali", "Veli", "Ayse", "Fatma"],
                    "siralama" : [1, 2, 3, 4]})

dfb = pd.DataFrame({"calisanlar" : ["Ali", "Veli", "Ayse", "Fatma"],
                    "siralama" : [3, 1, 4, 2]})

In [260]:
pd.merge(dfa, dfb, on = "calisanlar")   # calisanları birleştirme olarak gördü fakat siralamaları x ve y olarak KENDİLİĞİNDEN ayırdı.

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [263]:
pd.merge(dfa, dfb, on = "calisanlar", suffixes = ["_maas", "_deneyim"])   # kendiliğinden olan değişenlerin isimlerini kendimiz ayırabiliriz.

  calisanlar  siralama_maas  siralama_deneyim
0        Ali              1                 3
1       Veli              2                 1
2       Ayse              3                 4
3      Fatma              4                 2

--------------------------------

## 2.4. Basit Toplulaştırma İşlemleri(Aggregation ve Gruplama İşlemleri)

In [264]:
import seaborn as sns   # seaborn kütüphanesini 'sns' olarak yazdık.

In [266]:
sns.load_dataset("planets")   # kütüphanenin içerisinde bulunan 'planets' ler

               method  number  orbital_period    mass  distance  year
0     Radial Velocity       1      269.300000   7.100     77.40  2006
1     Radial Velocity       1      874.774000   2.210     56.95  2008
2     Radial Velocity       1      763.000000   2.600     19.84  2011
3     Radial Velocity       1      326.030000  19.400    110.62  2007
4     Radial Velocity       1      516.220000  10.500    119.47  2009
5     Radial Velocity       1      185.840000   4.800     76.39  2008
6     Radial Velocity       1     1773.400000   4.640     18.15  2002
7     Radial Velocity       1      798.500000     NaN     21.41  1996
8     Radial Velocity       1      993.300000  10.300     73.10  2008
9     Radial Velocity       2      452.800000   1.990     74.79  2010
10    Radial Velocity       2      883.000000   0.860     74.79  2010
11    Radial Velocity       1      335.100000   9.880     39.43  2009
12    Radial Velocity       1      479.100000   3.880     97.28  2008
13    Radial Velocity       3     1078.000000   2.530     14.08  1996
14    Radial Velocity       3     2391.000000   0.540     14.08  2001
15    Radial Velocity       3    14002.000000   1.640     14.08  2009
16    Radial Velocity       1        4.230785   0.472     15.36  1995
17    Radial Velocity       5       14.651000   0.800     12.53  1996
18    Radial Velocity       5       44.380000   0.165     12.53  2004
19    Radial Velocity       5     4909.000000   3.530     12.53  2002
20    Radial Velocity       5        0.736540     NaN     12.53  2011
21    Radial Velocity       5      261.200000   0.172     12.53  2007
22    Radial Velocity       3        4.215000   0.016      8.52  2009
23    Radial Velocity       3       38.021000   0.057      8.52  2009
24    Radial Velocity       3      123.010000   0.072      8.52  2009
25    Radial Velocity       1      116.688400     NaN     18.11  1996
26    Radial Velocity       1      691.900000     NaN     81.50  2012
27    Radial Velocity       1      952.700000   5.300     97.18  2008
28    Radial Velocity       1      181.400000   3.200     45.52  2013
29            Imaging       1             NaN     NaN     45.52  2005
...               ...     ...             ...     ...       ...   ...
1005          Transit       1        3.693641     NaN    200.00  2012
1006          Transit       1        4.465633     NaN    330.00  2012
1007          Transit       1        4.617101     NaN    255.00  2012
1008          Transit       1        2.838971     NaN    455.00  2012
1009          Transit       1        5.017180     NaN    300.00  2012
1010          Transit       1        7.919585     NaN    125.00  2012
1011          Transit       1        4.305001     NaN    400.00  2012
1012          Transit       1        3.855900     NaN    480.00  2012
1013          Transit       1        4.411953     NaN    160.00  2012
1014          Transit       1        4.378090     NaN    330.00  2012
1015          Transit       1        1.573292     NaN    350.00  2012
1016          Transit       1        2.311424     NaN    310.00  2013
1017          Transit       1        4.086052     NaN    380.00  2012
1018          Transit       1        4.614420     NaN    225.00  2012
1019          Transit       1        2.903675     NaN    345.00  2012
1020          Transit       1        2.216742     NaN    340.00  2012
1021          Transit       1        2.484193     NaN    260.00  2013
1022          Transit       1        1.360031     NaN     93.00  2012
1023          Transit       1        2.175176     NaN    550.00  2012
1024          Transit       1        3.662387     NaN    240.00  2012
1025          Transit       1        3.067850     NaN     60.00  2012
1026          Transit       1        0.925542     NaN    470.00  2014
1027          Imaging       1             NaN     NaN     19.20  2011
1028          Transit       1        3.352057     NaN   3200.00  2012
1029          Imaging       1             NaN     NaN     10.10  2012
1030          Transit       1        3.941507     NaN    172.00  2006
1031          Transit       1        2.615864     NaN    148.00  2007
1032          Transit       1        3.191524     NaN    174.00  2007
1033          Transit       1        4.125083     NaN    293.00  2008
1034          Transit       1        4.187757     NaN    260.00  2008

[1035 rows x 6 columns]

In [267]:
df = sns.load_dataset("planets")  # dataframe olarak kaydettik.

In [269]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [271]:
df.shape   # 1035 tane gözlem yani 1035 satırımız var. Bir hayli fazla hehehehe.

(1035, 6)

In [272]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [273]:
df["mass"]

0        7.100
1        2.210
2        2.600
3       19.400
4       10.500
5        4.800
6        4.640
7          NaN
8       10.300
9        1.990
10       0.860
11       9.880
12       3.880
13       2.530
14       0.540
15       1.640
16       0.472
17       0.800
18       0.165
19       3.530
20         NaN
21       0.172
22       0.016
23       0.057
24       0.072
25         NaN
26         NaN
27       5.300
28       3.200
29         NaN
         ...
1005       NaN
1006       NaN
1007       NaN
1008       NaN
1009       NaN
1010       NaN
1011       NaN
1012       NaN
1013       NaN
1014       NaN
1015       NaN
1016       NaN
1017       NaN
1018       NaN
1019       NaN
1020       NaN
1021       NaN
1022       NaN
1023       NaN
1024       NaN
1025       NaN
1026       NaN
1027       NaN
1028       NaN
1029       NaN
1030       NaN
1031       NaN
1032       NaN
1033       NaN
1034       NaN
Name: mass, Length: 1035, dtype: float64

In [274]:
df["mass"].count()

513

In [276]:
df.describe()   # istatistikçilerin sevdiği bir veri tipi

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [277]:
df.describe().T    # dataframe in transpozunu alır.

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

count()

first()

last()

mean()

median()

min()

max()

std()

var()

In [278]:
df["mass"].describe()

count    513.000000
mean       2.638161
std        3.818617
min        0.003600
25%        0.229000
50%        1.260000
75%        3.040000
max       25.000000
Name: mass, dtype: float64

In [279]:
df.mean()   # dataframedeki bütün değerlerin ortalamaları

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [280]:
df.dropna().describe()   # NaN değerlerden kurtulmak için.

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [281]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

------------------

## 2.5. Gruplama İşlemleri

In [284]:
df = pd.DataFrame({"gruplar" : ["A", "B", "C", "A", "B", "C"],
                   "veri" : [10, 11, 52, 23, 43, 55]}, columns = ["gruplar", "veri"])   # sözlük yapısı üzerinden dataframe tanımlıyoruz.

In [285]:
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [286]:
df.groupby("gruplar")    # grupların aynı olanları bir araya getirir.

In [288]:
df.groupby("gruplar").sum()   # grupların içerisindeki değişkenleri aynı olanları topladı.

         veri
gruplar
A          33
B          54
C         107

In [289]:
import seaborn as sns

dfPlanets = sns.load_dataset("planets")

In [290]:
dfPlanets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [291]:
dfPlanets.groupby("method")

In [292]:
dfPlanets.groupby("method")["orbital_period"]

In [293]:
dfPlanets.groupby("method")["orbital_period"].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [294]:
dfPlanets.iloc[0]

method            Radial Velocity
number                          1
orbital_period              269.3
mass                          7.1
distance                     77.4
year                         2006
Name: 0, dtype: object

In [295]:
dfPlanets.iloc[0][0]

'Radial Velocity'

In [298]:
dfPlanets.iloc[0:2]

            method  number  orbital_period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008

In [299]:
dfPlanets

               method  number  orbital_period    mass  distance  year
0     Radial Velocity       1      269.300000   7.100     77.40  2006
1     Radial Velocity       1      874.774000   2.210     56.95  2008
2     Radial Velocity       1      763.000000   2.600     19.84  2011
3     Radial Velocity       1      326.030000  19.400    110.62  2007
4     Radial Velocity       1      516.220000  10.500    119.47  2009
5     Radial Velocity       1      185.840000   4.800     76.39  2008
6     Radial Velocity       1     1773.400000   4.640     18.15  2002
7     Radial Velocity       1      798.500000     NaN     21.41  1996
8     Radial Velocity       1      993.300000  10.300     73.10  2008
9     Radial Velocity       2      452.800000   1.990     74.79  2010
10    Radial Velocity       2      883.000000   0.860     74.79  2010
11    Radial Velocity       1      335.100000   9.880     39.43  2009
12    Radial Velocity       1      479.100000   3.880     97.28  2008
13    Radial Velocity       3     1078.000000   2.530     14.08  1996
14    Radial Velocity       3     2391.000000   0.540     14.08  2001
15    Radial Velocity       3    14002.000000   1.640     14.08  2009
16    Radial Velocity       1        4.230785   0.472     15.36  1995
17    Radial Velocity       5       14.651000   0.800     12.53  1996
18    Radial Velocity       5       44.380000   0.165     12.53  2004
19    Radial Velocity       5     4909.000000   3.530     12.53  2002
20    Radial Velocity       5        0.736540     NaN     12.53  2011
21    Radial Velocity       5      261.200000   0.172     12.53  2007
22    Radial Velocity       3        4.215000   0.016      8.52  2009
23    Radial Velocity       3       38.021000   0.057      8.52  2009
24    Radial Velocity       3      123.010000   0.072      8.52  2009
25    Radial Velocity       1      116.688400     NaN     18.11  1996
26    Radial Velocity       1      691.900000     NaN     81.50  2012
27    Radial Velocity       1      952.700000   5.300     97.18  2008
28    Radial Velocity       1      181.400000   3.200     45.52  2013
29            Imaging       1             NaN     NaN     45.52  2005
...               ...     ...             ...     ...       ...   ...
1005          Transit       1        3.693641     NaN    200.00  2012
1006          Transit       1        4.465633     NaN    330.00  2012
1007          Transit       1        4.617101     NaN    255.00  2012
1008          Transit       1        2.838971     NaN    455.00  2012
1009          Transit       1        5.017180     NaN    300.00  2012
1010          Transit       1        7.919585     NaN    125.00  2012
1011          Transit       1        4.305001     NaN    400.00  2012
1012          Transit       1        3.855900     NaN    480.00  2012
1013          Transit       1        4.411953     NaN    160.00  2012
1014          Transit       1        4.378090     NaN    330.00  2012
1015          Transit       1        1.573292     NaN    350.00  2012
1016          Transit       1        2.311424     NaN    310.00  2013
1017          Transit       1        4.086052     NaN    380.00  2012
1018          Transit       1        4.614420     NaN    225.00  2012
1019          Transit       1        2.903675     NaN    345.00  2012
1020          Transit       1        2.216742     NaN    340.00  2012
1021          Transit       1        2.484193     NaN    260.00  2013
1022          Transit       1        1.360031     NaN     93.00  2012
1023          Transit       1        2.175176     NaN    550.00  2012
1024          Transit       1        3.662387     NaN    240.00  2012
1025          Transit       1        3.067850     NaN     60.00  2012
1026          Transit       1        0.925542     NaN    470.00  2014
1027          Imaging       1             NaN     NaN     19.20  2011
1028          Transit       1        3.352057     NaN   3200.00  2012
1029          Imaging       1             NaN     NaN     10.10  2012
1030          Transit       1        3.941507     NaN    172.00  2006
1031          Transit       1        2.615864     NaN    148.00  2007
1032          Transit       1        3.191524     NaN    174.00  2007
1033          Transit       1        4.125083     NaN    293.00  2008
1034          Transit       1        4.187757     NaN    260.00  2008

[1035 rows x 6 columns]

In [300]:
dfPlanets.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

--------------------------------

## 2.6. Aggregate, Transform, Filter, Apply

In [302]:
import numpy as np
import pandas as pd

df = pd.DataFrame({"gruplar" : ["A", "B", "C", "A", "B", "C"],
                   "degisken1" : [10, 23, 33, 22, 11, 99],
                   "degisken2" : [100, 253, 333, 262, 111, 969]},
                   columns = ["gruplar", "degisken1", "degisken2"])

In [303]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [304]:
df.groupby("gruplar").aggregate(["min", np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [305]:
df.groupby("gruplar").aggregate({"degisken1" : "min", "degisken2" : "max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [316]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [317]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [318]:
df.groupby("gruplar").transform(lambda x : x - x.mean())

   degisken1  degisken2
0       -6.0      -81.0
1        6.0       71.0
2      -33.0     -318.0
3        6.0       81.0
4       -6.0      -71.0
5       33.0      318.0

In [319]:
df.groupby("gruplar").transform(lambda x : (x - x.mean()) / x.std())   # lambda - transform kullanarak standartlaşma işlemi

   degisken1  degisken2
0  -0.707107  -0.707107
1   0.707107   0.707107
2  -0.707107  -0.707107
3   0.707107   0.707107
4  -0.707107  -0.707107
5   0.707107   0.707107

In [320]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [321]:
df.groupby("gruplar").apply(np.mean)  # daha performanslı

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [322]:
df.groupby(df["gruplar"]).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

In [323]:
L = [0, 1, 0, 1, 2, 0]

In [327]:
df.groupby(L).sum()  # yeni bir 'dışsal' indexleme oluşturduk ve işlemimizi ona göre yaptık. Dolayısı ile indexler değişti, farklı sonuçlar geldi.

   degisken1  degisken2
0        142       1402
1         45        515
2         11        111

In [325]:
df.groupby(df["gruplar"]).sum()

         degisken1  degisken2
gruplar
A               32        362
B               34        364
C              132       1302

------------------------

## 2.6. Pivot Tablolar

In [328]:
import numpy as np
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset("titanic")

In [329]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [330]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [331]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [332]:
titanic.groupby(["sex", "class"])["survived"].aggregate("mean")

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [333]:
titanic.groupby(["sex", "class"])["survived"].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [335]:
titanic.pivot_table("survived", index = "sex", columns = "class")   # bunun daha kolay olduğu çok açık bir şekilde ortada

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [336]:
titanic.pivot_table("age", index = "sex", columns = "embark_town")

embark_town  Cherbourg  Queenstown  Southampton
sex
female       28.344262   24.291667    27.771505
male         32.998841   30.937500    30.291440

In [338]:
titanic.pivot_table("age", index = "sex", columns = "alive")  # titanicde ölen kadınların yaş ortalaması 25, erkek ortalaması 31,...

alive          no        yes
sex
female  25.046875  28.847716
male    31.618056  27.276022

In [343]:
age = pd.cut(titanic["age"], [0, 18, 90])  # amacımız sürekli değişkeni kategorik değişkene çevirmek.

In [340]:
age

0      (18.0, 90.0]
1      (18.0, 90.0]
2      (18.0, 90.0]
3      (18.0, 90.0]
4      (18.0, 90.0]
5               NaN
6      (18.0, 90.0]
7       (0.0, 18.0]
8      (18.0, 90.0]
9       (0.0, 18.0]
10      (0.0, 18.0]
11     (18.0, 90.0]
12     (18.0, 90.0]
13     (18.0, 90.0]
14      (0.0, 18.0]
15     (18.0, 90.0]
16      (0.0, 18.0]
17              NaN
18     (18.0, 90.0]
19              NaN
20     (18.0, 90.0]
21     (18.0, 90.0]
22      (0.0, 18.0]
23     (18.0, 90.0]
24      (0.0, 18.0]
25     (18.0, 90.0]
26              NaN
27     (18.0, 90.0]
28              NaN
29              NaN
           ...
861    (18.0, 90.0]
862    (18.0, 90.0]
863             NaN
864    (18.0, 90.0]
865    (18.0, 90.0]
866    (18.0, 90.0]
867    (18.0, 90.0]
868             NaN
869     (0.0, 18.0]
870    (18.0, 90.0]
871    (18.0, 90.0]
872    (18.0, 90.0]
873    (18.0, 90.0]
874    (18.0, 90.0]
875     (0.0, 18.0]
876    (18.0, 90.0]
877    (18.0, 90.0]
878             NaN
879    (18.0, 90.0]
880    (18.0, 90.0]
881    (18.0, 90.0]
882    (18.0, 90.0]
883    (18.0, 90.0]
884    (18.0, 90.0]
885    (18.0, 90.0]
886    (18.0, 90.0]
887    (18.0, 90.0]
888             NaN
889    (18.0, 90.0]
890    (18.0, 90.0]
Name: age, Length: 891, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [341]:
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [344]:
titanic.pivot_table("survived", ["sex",age], "class")  # sürekli değişkeni kategorik değişkene çevirdik.

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [346]:
fare = pd.qcut(titanic["fare"], 2)

In [347]:
fare

0       (-0.001, 14.454]
1      (14.454, 512.329]
2       (-0.001, 14.454]
3      (14.454, 512.329]
4       (-0.001, 14.454]
5       (-0.001, 14.454]
6      (14.454, 512.329]
7      (14.454, 512.329]
8       (-0.001, 14.454]
9      (14.454, 512.329]
10     (14.454, 512.329]
11     (14.454, 512.329]
12      (-0.001, 14.454]
13     (14.454, 512.329]
14      (-0.001, 14.454]
15     (14.454, 512.329]
16     (14.454, 512.329]
17      (-0.001, 14.454]
18     (14.454, 512.329]
19      (-0.001, 14.454]
20     (14.454, 512.329]
21      (-0.001, 14.454]
22      (-0.001, 14.454]
23     (14.454, 512.329]
24     (14.454, 512.329]
25     (14.454, 512.329]
26      (-0.001, 14.454]
27     (14.454, 512.329]
28      (-0.001, 14.454]
29      (-0.001, 14.454]
             ...
861     (-0.001, 14.454]
862    (14.454, 512.329]
863    (14.454, 512.329]
864     (-0.001, 14.454]
865     (-0.001, 14.454]
866     (-0.001, 14.454]
867    (14.454, 512.329]
868     (-0.001, 14.454]
869     (-0.001, 14.454]
870     (-0.001, 14.454]
871    (14.454, 512.329]
872     (-0.001, 14.454]
873     (-0.001, 14.454]
874    (14.454, 512.329]
875     (-0.001, 14.454]
876     (-0.001, 14.454]
877     (-0.001, 14.454]
878     (-0.001, 14.454]
879    (14.454, 512.329]
880    (14.454, 512.329]
881     (-0.001, 14.454]
882     (-0.001, 14.454]
883     (-0.001, 14.454]
884     (-0.001, 14.454]
885    (14.454, 512.329]
886     (-0.001, 14.454]
887    (14.454, 512.329]
888    (14.454, 512.329]
889    (14.454, 512.329]
890     (-0.001, 14.454]
Name: fare, Length: 891, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [348]:
titanic.pivot_table("survived", ["sex", age], [fare, "class"])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308

In [349]:
titanic.pivot_table(index = "sex", columns = "class",
                    aggfunc = {"survived" : sum, "fare" : "mean"})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [351]:
titanic.pivot_table("survived", index = "sex", columns = "class", margins = True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

-------------------------------

## 2.7. R-Dplyr Tarzı Veri Manipülasyonu

In [352]:
!pip install dfply

Collecting dfply
  Downloading https://files.pythonhosted.org/packages/53/91/18ab48c64661252dadff685f8ddbc6f456302923918f488714ee2345d49b/dfply-0.3.3-py3-none-any.whl (612kB)
Requirement already satisfied: pandas in c:\users\sefa3\anaconda3\lib\site-packages (from dfply) (0.24.2)
Requirement already satisfied: numpy in c:\users\sefa3\anaconda3\lib\site-packages (from dfply) (1.16.2)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\sefa3\anaconda3\lib\site-packages (from pandas->dfply) (2.8.0)
Requirement already satisfied: pytz>=2011k in c:\users\sefa3\anaconda3\lib\site-packages (from pandas->dfply) (2018.9)
Requirement already satisfied: six>=1.5 in c:\users\sefa3\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas->dfply) (1.12.0)
Installing collected packages: dfply
Successfully installed dfply-0.3.3

In [353]:
from dfply import *

In [362]:
df = diamonds.copy()
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [359]:
df >> head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [360]:
# df >>= head

In [363]:
df

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
5       0.24  Very Good     J    VVS2   62.8   57.0    336  3.94  3.96  2.48
6       0.24  Very Good     I    VVS1   62.3   57.0    336  3.95  3.98  2.47
7       0.26  Very Good     H     SI1   61.9   55.0    337  4.07  4.11  2.53
8       0.22       Fair     E     VS2   65.1   61.0    337  3.87  3.78  2.49
9       0.23  Very Good     H     VS1   59.4   61.0    338  4.00  4.05  2.39
10      0.30       Good     J     SI1   64.0   55.0    339  4.25  4.28  2.73
11      0.23      Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
12      0.22    Premium     F     SI1   60.4   61.0    342  3.88  3.84  2.33
13      0.31      Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
14      0.20    Premium     E     SI2   60.2   62.0    345  3.79  3.75  2.27
15      0.32    Premium     E      I1   60.9   58.0    345  4.38  4.42  2.68
16      0.30      Ideal     I     SI2   62.0   54.0    348  4.31  4.34  2.68
17      0.30       Good     J     SI1   63.4   54.0    351  4.23  4.29  2.70
18      0.30       Good     J     SI1   63.8   56.0    351  4.23  4.26  2.71
19      0.30  Very Good     J     SI1   62.7   59.0    351  4.21  4.27  2.66
20      0.30       Good     I     SI2   63.3   56.0    351  4.26  4.30  2.71
21      0.23  Very Good     E     VS2   63.8   55.0    352  3.85  3.92  2.48
22      0.23  Very Good     H     VS1   61.0   57.0    353  3.94  3.96  2.41
23      0.31  Very Good     J     SI1   59.4   62.0    353  4.39  4.43  2.62
24      0.31  Very Good     J     SI1   58.1   62.0    353  4.44  4.47  2.59
25      0.23  Very Good     G    VVS2   60.4   58.0    354  3.97  4.01  2.41
26      0.24    Premium     I     VS1   62.5   57.0    355  3.97  3.94  2.47
27      0.30  Very Good     J     VS2   62.2   57.0    357  4.28  4.30  2.67
28      0.23  Very Good     D     VS2   60.5   61.0    357  3.96  3.97  2.40
29      0.23  Very Good     F     VS1   60.9   57.0    357  3.96  3.99  2.42
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53910   0.70    Premium     E     SI1   60.5   58.0   2753  5.74  5.77  3.48
53911   0.57    Premium     E      IF   59.8   60.0   2753  5.43  5.38  3.23
53912   0.61    Premium     F    VVS1   61.8   59.0   2753  5.48  5.40  3.36
53913   0.80       Good     G     VS2   64.2   58.0   2753  5.84  5.81  3.74
53914   0.84       Good     I     VS1   63.7   59.0   2753  5.94  5.90  3.77
53915   0.77      Ideal     E     SI2   62.1   56.0   2753  5.84  5.86  3.63
53916   0.74       Good     D     SI1   63.1   59.0   2753  5.71  5.74  3.61
53917   0.90  Very Good     J     SI1   63.2   60.0   2753  6.12  6.09  3.86
53918   0.76    Premium     I     VS1   59.3   62.0   2753  5.93  5.85  3.49
53919   0.76      Ideal     I    VVS1   62.2   55.0   2753  5.89  5.87  3.66
53920   0.70  Very Good     E     VS2   62.4   60.0   2755  5.57  5.61  3.49
53921   0.70  Very Good     E     VS2   62.8   60.0   2755  5.59  5.65  3.53
53922   0.70  Very Good     D     VS1   63.1   59.0   2755  5.67  5.58  3.55
53923   0.73      Ideal     I     VS2   61.3   56.0   2756  5.80  5.84  3.57
53924   0.73      Ideal     I     VS2   61.6   55.0   2756  5.82  5.84  3.59
53925   0.79      Ideal     I     SI1   61.6   56.0   2756  5.95  5.97  3.67
53926   0.71      Ideal     E     SI1   61.9   56.0   2756  5.71  5.73  3.54
53927   0.79       Good     F     SI1   58.1   59.0   2756  6.06  6.13  3.54
53928   0.79    Premium     E     SI2   61.4   58.0   2756  6.03  5.96  3.68
53929   0.71      Ideal     G     VS1   61.4   56.0   2756  5.76  5.73  3.53
53930   0.71    Premium     E     SI1   60.5   55.0   2756  5.79  5.74  3.49
53931   0.71    Premium     F     SI1   59.8   62.0   2756  5.74  5.73  3.43
53932   0.70  Very Good     E     VS2   60.5   59.0   2757  5.71  5.76  3.47
53933   0.70  Very Good     E     VS2   61.2   59.0   2757  5.69  5.72  3.49
53934   0.72    Premium     D     SI1   62.7   59.0   2757  5.69  5.73  3.58
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [364]:
# devamına bakmadım. R dersine çalışırken öğrenirim :D

----------------

## 2.8. Dış Kaynaklı Veri Okuma

In [365]:
pwd

'C:\\Users\\Sefa3\\Desktop\\Programlama\\Spyder Veri Bilimi\\5. Veri Manipülasyonu'

In [366]:
import numpy as np
import pandas as pd

In [369]:
pd.read_csv("reading_data/ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [370]:
pd.read_csv("reading_data/ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [371]:
pd.read_csv("reading_data/duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [372]:
pd.read_excel("reading_data/ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0